wegam/STM32F1xWorkSpace/Driver/Components/SCR/LCD.c
	LCDSYS->Display.WriteAddress(HSX,HSY,HEX,HEY);
	LCD_WriteDataStart();
	for(i=0;i<=HEX-HSX;i++)
	{
		for(j=0;j<=HEY-HSY;j++)
		{
			LCD_WriteData(color);
		}
	}
	LCD_WriteDataEnd();	
}
/**************************************************************************************************
* [Function] R61509V_Setbackground:  设置背景颜色
* [param01]u16 BackColor: 背景颜色值
**************************************************************************************************/
void LCD_SetBackground(  u16 BackColor )
{
	LCD_Clean(BackColor);	//清除屏幕函数
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_ShowChar(
										u16 x,			//x				:起点x坐标
										u16 y,			//y				:起点y坐标
										u8 font,		//font		:字体大小
										u8 num,			//num			:字节数
										u8 *Buffer	//Buffer	:显示的内容缓存
)		//高通字库测试程序
{
	u8 temp;
	u8 i=0,j=0;
	unsigned short x1=0,x2=0,y1=0,y2=0;
	u16 colortemp=LCDSYS->Data.PColor;
//	CoordinateTransform(&x1,&y1,&x2,&y2);
	x1	=	x;
	y1	=	y;
	
	if(font==12)
	{
		if(x>LCDSYS->Data.MaxV-12||y>LCDSYS->Data.MaxH-12)
			return;
		
		x2	=	x+12-1;
		y2	=	y+12-1;
//		LCD_SetWindowAddress(x,y,x+12-1,y+12);      //设置光标位置 
	}
	if(font==16)
	{
		if(x>LCDSYS->Data.MaxV-16||y>LCDSYS->Data.MaxH-16)
			return;
		x2	=	x+16-1;
		y2	=	y+16-1;
//		LCD_SetWindowAddress(x,y,x+16-1,y+16);      //设置光标位置 
	}
	if(font==24)
	{
		if(x>LCDSYS->Data.MaxV-24||y>LCDSYS->Data.MaxH-24)
			return;
		x2	=	x+24-1;
		y2	=	y+24-1;
//		LCD_SetWindowAddress(x,y,x+24-1,y+24);      //设置光标位置 
	}
	else if(font==32)
	{
		if(x>LCDSYS->Data.MaxV-32||y>LCDSYS->Data.MaxH-32)
			return;
		if(num==128)
		{
			x2	=	x+32-1;
			y2	=	y+32-1;
//			LCD_SetWindowAddress(x,y,x+32-1,y+32);      //设置光标位置
		}
		else
		{
			x2	=	x+16-1;
			y2	=	y+32-1;
//			LCD_SetWindowAddress(x,y,x+16-1,y+32);      //设置光标位置 
		}
	}
	else
	{
//		return ;
	}
	LCDSYS->Display.WriteAddress(x1,y1,x2,y2);//设置显示区域
	i=0;
	for(i=0;i<num;i++)
	{ 
		u16 LCD_PEN_COLOR	=	LCDSYS->Data.PColor;   	//画笔色	
		temp=Buffer[i];		 					//调用1608字体--二维数组形式--字库使用时取消
//		temp	=	0xFF;
		for(j=0;j<8;j++)
		{
			if((temp&0x80)==0X80)
			{
				LCD_PEN_COLOR=LCDSYS->Data.PColor;
			}
			else
				LCD_PEN_COLOR=LCDSYS->Data.BColor;
			LCD_WriteDataStart();
			LCD_WriteData(LCD_PEN_COLOR);
			LCD_WriteDataEnd();
			temp=temp<<1;
		}
		LCDSYS->Data.PColor=colortemp;	
	}	
}

/*******************************************************************************
*函数名		:	LCD_ShowChar
*功能描述	:	在指定位置显示一个字符
*输入			: x,y		:起点坐标
						num		:要显示的字符:" "--->"~"
						mode	:叠加方式(1)还是非叠加方式(0)
						num		:要显示的字符:" "--->"~"
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void LCD_ShowCharT(u16 x,u16 y,u8 num,u8 mode)
{
////	LCD_BACK_COLOR	//背景色
////	LCD_POINT_COLOR	//画笔色
//	u8 temp;
//	u8 pos,t;
//	u16 x0=x;
//	u16 colortemp=LCD_POINT_COLOR; 
//	if(x>LCD_V-16||y>LCD_H-16)
//		return;	    
//	//设置窗口		   
//	num=num-' ';//得到偏移后的值
////	num=41;//得到偏移后的值
//	
//	
////	LCD_SetWindowAddress(x,y,x+8-1,y+16-1);      //设置光标位置 
//	if(!mode) //非叠加方式
//	{
//		for(pos=0;pos<16;pos++)
//		{ 
//			temp=code_asc2_1608[(u16)num*16+pos];		 		//调用1608字体
////			temp=code_num_1608[(u16)num*16+pos];		 //调用1608字体
//			for(t=0;t<8;t++)
//			{                 
//				if((temp&0x01)==0x01)
//					LCD_POINT_COLOR=colortemp;
//				else
//					LCD_POINT_COLOR=LCD_BACK_COLOR;

//				LCD_DrawDot(x,y,LCD_POINT_COLOR);//画一个点 
//				
//				temp=temp>>1; 
//				x++;
//			}
//			x=x0;
//			y++;
//		}	
//	}
//	else//叠加方式
//	{
//		for(pos=0;pos<16;pos++)
//		{
//			temp=code_asc2_1608[(u16)num*16+pos];		 //调用1608字体
//			for(t=0;t<8;t++)
//			{                 
//				if(temp&0x01)
//					LCD_DrawDot(x+t,y+pos,LCD_POINT_COLOR);//画一个点     
//				temp>>=1; 
//			}
//		}
//	}
//	LCD_POINT_COLOR=colortemp;	    	   	 	  
}
/*******************************************************************************
*函数名			:	R61509V_Clean
*功能描述		:	显示汉字程序
*输入				: 
*返回值			:	无
*******************************************************************************/
void LCD_ShowChinese(unsigned char zimo[720],unsigned int backcolor)  //写入字符
{
	unsigned char j,flag=0;
	unsigned char *point;
	unsigned int i,x1=0x00,x2=0x17,y1=0x00,y2=0x17;
	unsigned int colors[10]=
	{
		0xf800,0x07e0,0x001f,0xffe0,0x0000,0x07ff,0xf81f,0xb81f,0x7f7,0xfec0
	};
	point=&zimo[0];
	LCD_WriteDataStart();
	for(i=1;i<=720;i++,point++)
	{  
		for(j=0;j<=7;j++)
		{
			if((*point<<j)&0x80)
			{
				LCD_WriteData(colors[flag]);
			}
			else
			{
				LCD_WriteData(backcolor);
			}
		}   
		if(i%72==0)
		{
			x1=x1+24;x2=x2+24;y1=y1+24;y2=y2+24;
			flag=flag+1;
			LCDSYS->Display.WriteAddress(x1,y1,x2,y2);
		}   
	}
	LCD_WriteDataEnd();
}
/*******************************************************************************
*函数名		:	LCD_ShowString
*功能描述	:	显示字符串高通字库
*输入			: x,y:起点坐标
						*p:字符串起始地址
						用16字体
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
unsigned int LCD_Printf(u16 x,u16 y,u8 font,const char *format,...)				//后边的省略号就是可变参数
{ 
		
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//		static char string[ 256 ];			//定义数组，
//  	va_start( ap, format );
//		vsprintf( string , format, ap );    
//		va_end( ap );
	

	u16 i=0;		//显示
	char	Char_Buffer[256];		//记录format内码
	//1)**********获取数据宽度
	u16 num=strlen((const char*)format);		//获取数据宽度
	//2)**********定义缓冲区大小变量
	unsigned int BufferSize;
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args; 
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	BufferSize = vsnprintf(Char_Buffer, 128,format, args);
	num=BufferSize;
	//7)**********结束可变参数的获取
	va_end(args);                                      		
	
	for(i=0;i<num;i++)
	{ 
		unsigned char dst=Char_Buffer[i];
//		u8 GTBuffer[512]={0};		//点阵数据存储空间
//		u32 lengh=0;						//汉字点阵的数据长度		
		if(dst>0x80)		//双字节--汉字
		{
			u16 word=dst<<8;			
//			Char_Buffer++;
			dst=Char_Buffer[i+1];
			word=word|dst;			
			//显示超限判断
			if(font==16&&x>LCDSYS->Data.MaxV-16)
			{
				x=0;
				y+=16;
			}
			if(font==32&&x>LCDSYS->Data.MaxV-32)
			{
				x=0;
				y+=32;
			}
			if(font==16&&y>LCDSYS->Data.MaxV-16)
			{
				y=x=0;
			}
			if(font==32&&y>LCDSYS->Data.MaxV-32)
			{
				y=x=0;
			}
			GT32L32_ReadBuffer(&LCDSYS->GT32L32,font,word);		//从字库中读数据函数
			//写入屏幕
			LCD_ShowChar(x,y,font,LCDSYS->GT32L32.Data.BufferSize,LCDSYS->GT32L32.Data.Buffer);
			//显示地址增加	
			if(font==12)
			{
				x+=12;
			}
			else if(font==16)
			{
				x+=16;
			}
			else if(font==24)
			{
				x+=24;
			}
			else if(font==32)
			{
				x+=32;
			}
//			Char_Buffer++;
			i++;		//双字节，减两次
		}
		else		//单字节
		{			
			if(x>LCDSYS->Data.MaxH-16)
			{
				x=0;
				y+=32;
			}
			if(font==16&&y>LCDSYS->Data.MaxH-16)
			{
				y=x=0;
			}
			if((font==32)&&(y>LCDSYS->Data.MaxH-32))
			{
				y=x=0;
			}
			GT32L32_ReadBuffer(&LCDSYS->GT32L32,font,(u16)dst);		//从字库中读数据函数
//			//写入屏幕
			LCD_ShowChar(x,y,font,LCDSYS->GT32L32.Data.BufferSize,LCDSYS->GT32L32.Data.Buffer);			
			//显示地址增加
			if(font==12)
			{
				x+=6;
			}
			else if(font==16)
			{
				x+=8;
			}
			else if(font==24)
			{
				x+=12;
			}
			else if(font==32)
			{
				x+=16;
			}			
//			Char_Buffer++;
//			i++;		//双字节，减两次
		}
	}
	//9)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
//	free(Char_Buffer);		//发送完成后注意应该释放缓冲区：free(Char_Buffer); 
	return BufferSize;
//	return 0;
}








/**************************************************************************************************
* [Function] LCD_DrawPixelEx:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 color: description
**************************************************************************************************/
void LCD_DrawPixelEx( u16 x, u16 y, u16 color )
{
	LCD_DrawDot(x,y,color);		//画点
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void LCD_Delay(u32 xms)
{
	while(xms--);
}

//#endif//LCD_61509_EN
/************************************** The End Of FILE **************************************/


